Autodesk.Revit.DB.PageOrientationType
An enumerated type listing all Page Orientation types of Print Setting

Autodesk.Revit.DB.PageOrientationType.Auto
Auto Page Orientation

Autodesk.Revit.DB.PageOrientationType.Landscape
The type of Page Orientation is Landscape

Autodesk.Revit.DB.PageOrientationType.Portrait
The type of Page Orientation is Portrait